Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: Применяется к группе радиопереключателей для выравнивания их в линию.
en: The modifier aligns all radio switches of the group in a line.

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'line' }, name : 'radio-line', options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'line' }, name : 'radio-line', options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: Модификатор может быть установлен:
en: The modifier can be applied to:

source: всей группе радиопереключателей
en: The radio-group:

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', disabled : true }, name : 'radio', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', disabled : true }, name : 'radio', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: отдельному радиопереключателю в группе
en: The separate radio switch of the group:

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-line', val : 2, options : [ { val : 1, text : 'Футбол', disabled : true }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-line', val : 2, options : [ { val : 1, text : 'Football', disabled : true }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-line', val : 2, options : [ { val : 1, text : 'Футбол', disabled : true }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-line', val : 2, options : [ { val : 1, text : 'Football', disabled : true }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button', focused : true }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button', focused : true }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Soccer' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', focused : true }, name : 'radio', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', focused : true }, name : 'radio', val : 2, options : [ { val : 1, text : 'Soccer' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: Допустимые значения для темы islands: 'm', 'l'.
en: Acceptable values for the islands theme: 'm', 'l'.

source: Задает размер всем радиопереключателям в группе.
en: Sets the size value for all types of radio-groups.

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'l' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'l' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'l', type : 'button' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'l', type : 'button' }, name : 'radio-button', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball' } ] }

source: Определяет имя группы радиопереключателей.
en: Specifies the block unique name.

source: Тип: String, Number.
en: Type: String, Number.

source: Определяет значение выбранного радиопереключателя.
en: Specifies a set of values for the selected radio switches.

source: Поле options
en: options field

source: Тип: Array.
en: Type: Array.

source: Определяет набор значений для каждого радиопереключателя группы.
en: Specifies a set of values for each radio switch of the group.

source: Каждому типу радиопереключателей соответствует разный набор значений.
en: Each type of radio switch has its own set of values.

source: Значение радиопереключателя, которое будет отправлено на сервер, если он выбран.
en: The value to send to the server if the radio switch is selected.

source: Текст подписи к радиопереключателю.
en: Radio switch lable.

source: Иконка. Формируется блоком icon. Используется только с модификатором type в значении button.
en: The radio switch icon, which is created by the icon block. Use icons only for radio switches with the type modifier set to button.

source: Текст всплывающей подсказки. Используется только с модификатором type в значении button.
en: Tooltip content. Use tooltips only for radio switches with type modifier set to button.

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 2, options : [ { val : 1, text : 'Футбол' }, { val : 2, text : 'Баскетбол' }, { val : 3, text : 'Гандбол', disabled : true } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm' }, name : 'radio-islands', val : 2, options : [ { val : 1, text : 'Football' }, { val : 2, text : 'Basketball' }, { val : 3, text : 'Handball', disabled : true } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 3, options : [ { val : 1, text : 'Футбол', title : 'Просмотр турнирной таблицы и состава команд.' }, { val : 2, disabled : true, text : 'Баскетбол', title : 'Просмотр турнирной таблицы и состава команд.' }, { val : 3, disabled : true, text : 'Гандбол', title : 'Просмотр турнирной таблицы и состава команд.' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 3, options : [ { val : 1, text : 'Football', title : 'View standings.' }, { val : 2, disabled : true, text : 'Basketball', title : 'View standings.' }, { val : 3, disabled : true, text : 'Handball', title : 'View standings.' } ] }

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 1, options : [ { val : 1, text : 'Новости по футболу', title : 'Подписаться на новости в группе', icon : { block : 'icon', mods : { social : 'twitter' } }, }, { val : 2, disabled : true, text : 'Новости по гандболу', title : 'Подписаться на новости в группе', icon : { block : 'icon', mods : { social : 'twitter' } } } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button' }, name : 'radio-islands', val : 1, options : [ { val : 1, text : 'Football news', title : 'Subscribe to the news', icon : { block : 'icon', mods : { social : 'twitter' } }, }, { val : 2, disabled : true, text : 'Handball news', title : 'Subscribe to the news', icon : { block : 'icon', mods : { social : 'twitter' } } } ] }

source: Используется для управления параметром выбора с двумя состояниями – «включено» и «выключено».
en: Use this block to control a selection parameter with two available states – ”ON“ and ”OFF“.

source: Тип чекбокса.
en: The type of checkbox.

source: Выбор чекбокса.
en: Selection of the checkbox.

source: Наведение курсором.
en: The hovered state.

source: Размер чекбокса. Используется для чекбоксов с модификатором theme в значении islands.
en: The size of the chackbox. Use sizes only for checkboxes with the theme modifier set to islands.

source: Уникальное имя чекбокса.
en: The unique block name.

source: Значение чекбокса, которое будет отправлено на сервер, если он выбран.
en: The value to send to the server if the checkbox is selected.

source: Текст подписи к чекбоксу.
en: Checkbox lable.

source: Иконка. Формируется блоком icon. Используется для чекбокса с модификатором type в значении button.
en: Checkbox icon. It is created by the iconblock. Use icons only when checkboxes with the type modifier is set to button.

source: Текст всплывающей подсказки. Используется для чекбокса с модификатором type в значении button.
en: Tooltip content. Use tooltips only for checkboxes when the type modifier is set to button.

source: Уникальный идентификатор чекбокса.
en: The checkbox unique ID.

source: Примечание HTML-атрибут autocomplete принудительно переведен в состояние off для обеспечения корректной работы блока.
en: NB The autocomplete HTML attribute is forced to off state by default to provide correct behavior of the block.

source: Допустимое значение: 'button'.
en: Acceptable value: 'button'.

source: Используется для изменения внешнего вида блока на кнопочный. В таком случае выбор чекбокса происходит нажатием на кнопку.
en: Use the modifier with the button value to change the appearance of the block: the checkbox is implemented by the button. Press the button to select the checkbox.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'button', val: 'val_1', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'button', val: 'val_1', text : 'Candies' }

source: Модификатор checked
en: checked modifier

source: Используется для выбора чекбокса.
en: Use the modifier to select the checkbox.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', checked : true }, name: 'name1', val : 'val_1', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', checked : true }, name: 'name1', val : 'val_1', text : 'Candies' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name: 'name2', val : 'val_2', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name: 'name2', val : 'val_2', text : 'Candies' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', disabled : true }, name: 'name1', val : 'val_0', text : 'Конфеты закончились' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', disabled : true }, name: 'name1', val : 'val_0', text : 'No more candies' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name: 'name2', val : 'val_1', text : 'Конфеты закончились' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', disabled : true }, name: 'name2', val : 'val_1', text : 'No more candies' }

source: { block : 'button', mods : { theme : 'islands', size : 'm', focused : true }, text : 'В фокусе' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', focused : true }, text : 'In focus' }

source: Модификатор hovered
en: hovered modifier

source: Способы использования: – .
en: Use case: – .

source: Выставляется блоку автоматически, когда курсор мыши находится в пределах контрола.
en: The modifier is added to the block automatically at the moment when you mouse it over.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm' }, name: 'islands', val: 'val_3', text : 'Тема islands' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm' }, name: 'islands', val: 'val_3', text : 'Islands theme' }

source: Задает размер блока.
en: Sets the size value for all types of checkboxe.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm' }, name: 'name1', val: 'val_1', text : 'Размер m' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm' }, name: 'name1', val: 'val_1', text : 'Size m' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: 'val_1', text : 'Размер m' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: 'val_1', text : 'Size m' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'l' }, name: 'name2', val: 'val_2', text : 'Размер l' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'l' }, name: 'name2', val: 'val_2', text : 'Size l' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'l', type : 'button' }, name: 'name1', val: 'val_1', text : 'Размер l' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'l', type : 'button' }, name: 'name1', val: 'val_1', text : 'Size l' }

source: Определяет уникальное имя чекбокса.
en: Specifies the block unique name.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: 'val_1', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: 'val_1', text : 'Candies' }

source: Значение чекбокса, которое будет отправлено на сервер.
en: Specifies the checkbox value to send to the server.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name2', val: 'val_2', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name2', val: 'val_2', text : 'Candies' }

source: Поле text
en: text field

source: Определяет текст подписи к чекбоксу или текст кнопки, если указан модификатор type в значении button.
en: Specifies checkbox lable or the text on the button if the type modifier with the modifier with the button is set to the block.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm' }, name: 'name1', val: '1', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm' }, name: 'name1', val: '1', text : 'Candies' }

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: '1', text : 'Конфеты' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: '1', text : 'Candies' }

source: Поле icon
en: icon field

source: Тип: BEMJSON.
en: Type: BEMJSON.

source: Определяет иконку, которая отображается с помощью блока icon.
en: Specifies the checkbox icon which is shown using the icon block.

source: Используется только для чекбокса с модификатором type в значении button.
en: Use this field only for checkboxes with the type modifier set to button.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name: 'name1', val : 1, text : 'Поделиться', icon : { block : 'icon', mods : { social : 'twitter' } } }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name: 'name1', val : 1, text : 'Share', icon : { block : 'icon', mods : { social : 'twitter' } } }

source: Поле title
en: title field

source: Определяет содержание всплывающей подсказки. Вид такой подсказки зависит от браузера, настроек операционной системы и не может быть изменен с помощью HTML-кода или стилей.
en: Specifies the tooltip content. The tooltip appearance depends on the browser and your operating system settings. You cannot change it applying HTML or different styles.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name: 'name1', val : 1, text : 'Поделиться', title : 'Кнопка выбора социальной сети', icon : { block : 'icon', mods : { social : 'twitter' } } }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button', checked : true }, name: 'name1', val : 1, text : 'Share', title : 'Share with friends', icon : { block : 'icon', mods : { social : 'twitter' } } }

source: Определяет уникальный идентификатор чекбокса.
en: Specifies the checkbox unique ID.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: '1', text : 'Конфеты', id : 'checkbox-id' }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: '1', text : 'Candies', id : 'checkbox-id' }

source: Определяет порядок получения фокуса при переходе между контролами с помощью клавиши Tab.
en: Specifies the tab order when pressing Tab to navigate between controls on a page.

source: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: '1', text : 'Конфеты', tabIndex : 3 }
en: { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'name1', val: '1', text : 'Candies', tabIndex : 3 }

source: Используется для создания раскрывающегося списка с возможностью одиночного или множественного выбора.
en: Use this block for creating a dropdown menu with the possibility of single or multiple choice.

source: Режим выбора пунктов раскрывающегося списка.
en: The selection mode for the dropdown menu list.

source: Ширина кнопки раскрывающегося списка.
en: The button width.

source: Имя раскрывающегося списка.
en: Name of the drop-down list.

source: Выбранное значение из списка. Если блоку установлен модификатор mode в значении check, выбранные значения всегда оформляются в виде массива.
en: The selected value from the dropdown list. If the mode modifier with the check value is applied to the block, the selected values must be declared as an array.

source: Значение, которое отображается в кнопке раскрывающегося списка, в случае, если ни один из пунктов выбран. Используется только для кнопки с модификатором type в значении check или в значении radio-check.
en: Button label, if a menu item is not selected. Use for the button with the type modifier set to check or to radio-check.

source: Массив пунктов списка.
en: The array of the menu items.

source: Максимальная высота выпадающего списка.
en: The maximum height of the dropdown menu.

source: Уникальный идентификатор раскрывающегося списка.
en: The unique identifier of the dropdown list.

source: Блок визуально представлен кнопкой и выпадающим списком.
en: The block is implemented by a button and a dropdown menu list.

source: Реализация блока поддерживает клавиатурное управление, если блок select находится в фокусе (установлен модификатор focused в значении true):
en: The block in the focused state supports key-pad control:

source: При скрытом выпадающем списке ввод с клавиатуры одного из названий пунктов автоматически выбирает данный пункт и подставляет его имя в кнопку раскрывающегося списка.
en: If the dropdown menu list is hidden, type the menu item name on your keyboard to select the menu item. The name of the menu item appears in the select button.

source: При раскрытом выпадающем списке ввод с клавиатуры одного из названий пунктов автоматически переводит фокус на данный пункт. Выбор происходит нажатием на кнопку Пробел или Ввод.
en: If the dropdown menu list is shown, type the menu item name on your keyboard to set the focused state to this menu item. Use Space bar or Enter buttons to select the menu item.

source: Клавиши Пробел, Ввод, Вверх и Вниз показывают раскрывающийся список.
en: To show the dropdown menu list, use Space bar, Enter, Up and Down buttons.

source: Модификатор mode
en: mode modifier

source: Допустимые значения: 'check, 'radio', 'radio-check'.
en: Acceptable values: 'check, 'radio', 'radio-check'.

source: Обязательный модификатор.
en: The mandatory modifier.

source: Список с множественным выбором (модификатор mode в значении check)
en: Multiple-choice list (mode modifier with check)

source: Позволяет выбрать произвольное количество пунктов в раскрывающемся списке.
en: Use to create the dropdown menu with the possibility to select any number of menu items.

source: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select1', val : [2, 3], text : 'Программа конференции', options : [ { val : 1, text : 'Доклад' }, { val : 2, text : 'Мастер-класс' }, { val : 3, text : 'Круглый стол' } ] }
en: { block : 'select', mods : { mode : 'check', theme : 'islands', size : 'm' }, name : 'select1', val : [2, 3], text : 'Программа конференции', options : [ { val : 1, text : 'Report' }, { val : 2, text : 'Workshop' }, { val : 3, text : 'Round-table conference' } ] }

source: Список с одиночным обязательным выбором (модификатор mode в значении radio)
en: Mandatory single-choice list (mode modifier with radio value)

source: Позволяет создать раскрывающийся список, в котором выбран ровно один пункт.
en: Use to create the dropdown menu that has one mandatory selected item.

source: Если пункт не выбран, то по умолчанию выбирается первое значение из списка.
en: If any item is not selected in BEMJSON declaration, the first menu item is selected by default.
